# AssemblyDifferenceConfiguration Properties

---
The AssemblyDifferenceConfiguration type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from AssemblyDifference)
Top
#### Reference
AssemblyDifferenceConfiguration Class
Autodesk.Revit.DB Namespace